Repository: TestArenaTM/TestArena
Catalog: application/languages/*/error.po
Languages: pl

# missingValue
source: The captcha must be completed
pl: Nie uzupełniono pola captcha.

# missingID
source: The captcha must be completed
pl: Nie uzupełniono pola captcha.

# badCaptcha
source: The captcha was invalid
pl: Błędnie uzupełnione pole captcha.

# captchaEmpty
source: The captcha must be completed
pl: Nie uzupełniono pola captcha.

# invalidCaptcha
source: The captcha was invalid
pl: Błędnie uzupełnione pole captcha.

# notSame
source: The form has expired. Please reload this page and try again.
pl: Ważność formularza wygasła. Spróbuj wysłać go ponownie.

# missingToken
source: The form has expired. Please reload this page and try again.
pl: Ważność formularza wygasła. Spróbuj wysłać go ponownie.

# emailExists
source: This email already exists in the system.
pl: Podany adres e-mail istnieje już w systemie.

source: Invalid token.
pl: Niepoprawny token.

# userPasswordNotValid
source: Your current password is different.
pl: Twoje aktualne hasło jest inne.

# emailAddressInvalid
source: Invalid email. Please enter your email again.
pl: Nieprawidłowy adres e-mail. Wprowadź adres ponownie.

# emailAddressQuotedString
source: Invalid email. Please enter your email again.
pl: Nieprawidłowy adres e-mail. Wprowadź adres ponownie.

# emailAddressLengthExceeded
source: Invalid number of characters e-mail
pl: Nieprawidłowa liczba znaków dla adresu e-mail

# emailNotExists
source: This email doesn't exist in database.
pl: Podany adres e-mail nie istnieje w systemie.

# emailAddressInvalidFormat
source: Invalid email format. Please enter your email again.
pl: Nieprawidłowy format adresu e-mail. Wprowadź adres ponownie.

# emailAddressDotAtom
source: Invalid email. Please enter your email again.
pl: Nieprawidłowy format adresu e-mail. Wprowadź adres ponownie.

# passwordNotMatch
source: Passwords do not match.
pl: Podane hasła nie są zgodne.

# stringLengthInvalid
source: Invalid type of data. String expected.
pl: Niepoprawny typ danych. Oczekiwano ciąg znaków.

# stringLengthTooShort
source: The field must contain at least __min__ characters.
pl: Minimalna liczba znaków dla pola to __min__.

# stringLengthTooLong
source: Maximum number of characters is __max__.
pl: Maksymalna liczba znaków dla pola to __max__.

# notEmptyInvalid
source: Invalid input data.
pl: Niepoprawny typ danych wejściowych.

# isEmpty
source: This field can't be blank.
pl: Pole wymagane

# notInArray
source: Value is not the one available in the list.
pl: Wartość nie jest jedną z dostępnych na liście

# simpleTextInvalidCharacters
source: Text can only consist of letters, numbers, spaces and characters: !@#$%&*\/()[]<>?.,"':;+-=_€
pl: Tekst może zawierać wyłącznie litery, cyfry, spacje oraz znaki !@#$%&*\/()[]<>?.,"':;+-=_€

# nameInvalidCharacters
source: Text can only consist of letters, numbers, spaces and characters: !@#$%&*\/()?.,"':;+-=_
pl: Tekst może zawierać wyłącznie litery, cyfry, spacje oraz znaki !@#$%&*\/()?.,"':;+-=_

# firstnameInvalidCharacters
source: First name can only consist of letters, spaces and characters: '-
pl: Imię może zawierać wyłącznie litery, spacje oraz znaki '-

# lastnameInvalidCharacters
source: Last name can only consist of letters, spaces and characters: '-
pl: Nazwisko może zawierać wyłącznie litery, spacje oraz znaki '-

# passwordInvalidCharacters
source: Password can only consist of letters (without national characters), numbers and characters: !@#$%^&*?
pl: Hasło może zawierać tylko małe i duże litery (bez znaków narodowych), cyfry oraz znaki !@#$%^&*?

# passwordInvalidFormat
source: Password must consist of at least one big letter, one small letter and one number.
pl: Hasło musi zawierać co najmniej jedną małą literę, jedną dużą literę oraz jedną cyfrę.

# roleNameExists
source: Name of a role already exists in the project.
pl: Nazwa roli już istnieje w projekcie.

# roleTypeExists
source: Type of a role already exists in the project.
pl: Typ roli już istnieje w projekcie.

# roleProjectsInvalidIds
source: Project IDs can only be numbers.
pl: Role project ids can only be numbers.

# roleProjectNotExists
source: Project doesn't exist in database.
pl: Role project not exists in database.

# roleSettingsEmpty
source: You need to choose at least one action.
pl: Musisz wybrać przynajmniej jedną akcję.

# projectPrefixInvalidCharacters
source: Prefix can only consist of the Latin script (without national marks) and numbers.
pl: Prefiks projektu może zawierać tylko litery alfabetu łacińskiego (bez znaków narodowych) i liczby.

# projectNameExists
source: Name of a project already exists in database.
pl: Nazwa projektu już istnieje w bazie danych.

# projectPrefixExists
source: Prefix already exists in database.
pl: Prefiks projektu już istnieje w bazie danych.

# usersInvalidIds
source: User IDs can only be numbers.
pl: Numery identyfikacyjne użytkowników mogą być wyłącznie liczbami.

# userIdNotExists
source: This user doesn't exist in the system
pl: Podany użytkownik nie istnieje w systemie.

# userNotExists
source: This user doesn't exist in the system.
pl: Podany użytkownik nie istnieje w systemie.

# dateInvalid
source: Invalid format.
pl: Niepoprawny format.

# dateInvalidDate
source: Invalid date.
pl: Niepoprawna data.

# dateFalseFormat
source: Invalid date format. Enter a valid date in __format__ format.
pl: Niepoprawny format daty. Wprowadź datę wg schematu __format__

# dateIsNotEarlier
source: Date must be less than '__field__'.
pl: Wprowadzona data musi być wcześniejsza od daty '__field__'.

# dateIsNotEarlierOrEqual
source: Date must be less than or equal to '__field__'.
pl: Wprowadzona data musi być wcześniejsza lub równa dacie '__field__'.

# dateIsNotLater
source: Date must be greater than '__field__'.
pl: Wprowadzona data musi być późniejsza od daty '__field__'.

# dateIsNotLaterOrEqual
source: Date must be greater than or equal to '__field__'.
pl: Wprowadzona data musi być późniejsza lub równa dacie '__field__'.

# dateNotBetween
source: The date must be between '__min__' and '__max__'.
pl: Data musi być pomiędzy '__min__' a '__max__' włącznie.

# dateNotBetweenStrict
source: The date is not between '__min__' and '__max__'.
pl: Data nie jest pomiędzy '__min__' and '__max__'.

# dateNotEarlier
source: Date must be less than '__date__'.
pl: Data musi być wcześniejsza niż '__date__' włącznie.

# dateNotEarlierStrict
source: Date must be less than '__date__'.
pl: Data musi być wcześniejsza niż '__date__'.

# dateNotLater
source: Date must be greater than '__date__'.
pl: Data musi być późniejsza niż '__date__' włącznie.

# dateNotLaterStrict
source: Date must be greater than '__date__'.
pl: Data musi być późniejsza niż '__date__'.

# fileImageSizeNotDetected
source: Unrecognized file size.
pl: Nie można rozpoznać rozmiaru pliku.

# imageIsCorrupted
source: The file is not a valid image.
pl: Wybrany plik nie jest poprawnym obrazkiem.

# fileUploadErrorFormSize
source: Maximum file size: 1MB.
pl: Maksymalna wielkość pliku to __maxFileSize__.

# fileSizeNotFound
source: Cannot read the file.
pl: Nie można odczytać pliku.

# fileUploadErrorNoFile
source: File was not uploaded.
pl: Plik nie został załączony.

# fileExtensionFalse
source: Unsupported file type. You can upload __extensions__ files only.
pl: Nieobsługiwany format pliku. Dozwolone są pliki z rozszerzeniem: __extensions__.

# fileExtensionNotFound
source: Cannot read the file.
pl: Nie można odczytać pliku.

# fileCountTooMany
source: Too many files.
pl: Zbyt dużo plików.

# fileCountTooFew
source: Not enough files.
pl: Za mało plików.

# fileSizeTooSmall
source: Insufficient file size.
pl: Za mały plik.

# isImage
source: This file is not an image.
pl: Wybrany plik nie jest obrazem.

# unsupportedType
source: Unsupported file type. You can upload .jpg or .png files only.
pl: Nieobsługiwany format pliku. Wypróbuj .jpg lub .png.

# avatarUnsupportedType
source: Unsupported file type. You can upload .jpg or .png files only.
pl: Nieobsługiwany format pliku. Wypróbuj .jpg lub .png.

# fileSizeTooBig
source: Maximum file size: 1MB.
pl: Maksymalna wielkość pliku to 1MB.

# fileNotExist
source: File doesn't exist.
pl: Plik nie istnieje.

# fileImageSizeWidthTooSmall
source: Insufficient image size. Your image must be at least 50 px wide.
pl: Niepoprawny rozmiar obrazu. Minimalna szerokość to 50 px.

# fileImageSizeHeightTooSmall
source: Insufficient image size. Your image must be at least 50 px tall.
pl: Niepoprawny rozmiar obrazu. Minimalna wysokość to 50 px.

# fileImageSizeWidthTooBig
source: Wrong image size. Maximum image width is 3000 px.
pl: Niepoprawny rozmiar obrazu. Maksymalna szerokość to 3000 px.

# fileImageSizeHeightTooBig
source: Wrong image size. Maximum image height is 3000 px.
pl: Niepoprawny rozmiar obrazu. Maksymalna wysokość to 3000 px.

# attachmentCanNotAdd
source: Can not add attachment because it has already been added.
pl: Nie można dodać załącznika, ponieważ już został dodany.

# attachmentNotSetIds
source: Not set ids.
pl: Nie ustawiono idetyfikatorów.

# productNameExists
source: Name already exists.
pl: Nazwa produktu już istnieje.

source: Invalid url.
pl: Nieprawidłowy url.

# urlNotExists
source: Page at the address does not exist.
pl: Strona pod podanym adresem nie istnieje.

# notFloat
source: This is not a number...
pl: To nie jest liczba.

# floatInvalid
source: This is not a number...
pl: To nie jest liczba.

# notBetween
source: The number must be between __min__ and __max__.
pl: Liczba musi zawierać się w zakresie od __min__ do __max__.

# notBetweenStrict
source: The number must be between __min__ and __max__.
pl: Liczba musi zawierać się pomiędzy __min__ i __max__.

# addressInvalidCharacters
source: Address can only consist of letters, numbers, spaces and characters: '-/
pl: Adres może zawierać wyłącznie litery, cyfry, spacje oraz znaki '-/

# zipCodeInvalidCharacters
source: ZIP code can only consist of numbers and character -
pl: Kod pocztowy może zawierać wyłącznie cyfry oraz znak -

# cityInvalidCharacters
source: Name of a city can only consist of letters, spaces and characters: '-
pl: Miasto może zawierać wyłącznie litery, spacje oraz znaki '-

# releaseNameExists
source: This name already exists.
pl: Nazwa wydania już istnieje.

# tagNameExists
source: This name already exists.
pl: Nazwa tagu już istnieje.

# testNameExists
source: This name already exists.
pl: Nazwa testu już istnieje.

# projectElementsInvalidIds
source: Projects can only be numbers.
pl: Projekty elementu mogą być tylko liczbami.

# projectElementNotExists
source: This element doesn't exist in database.
pl: Element projektu nie istnieje w bazie.

# environmentNameExists
source: The environment name already exists in database.
pl: Nazwa środowiska już istnieje w bazie danych!

# projectNoActive
source: Project is not active!
pl: Projekt nie jest aktywny!

# versionNameExists
source: The version name already exists in database.
pl: Nazwa wersji już istnieje w bazie danych!

# environmentInvalidIds
source: Environment ids can only be numbers.
pl: Środowisko nie istnieje w bazie danych.

# environmentNotExists
source: Environment not exists in database.
pl: Środowisko nie istnieje w bazie danych.

# versionInvalidIds
source: Version ids can only be numbers.
pl: Wersja nie istnieje w bazie danych.

# versionNotExists
source: Version not exists in database.
pl: Wersja nie istnieje w bazie danych.

# notInt
source: This is not a number...
pl: Pole musi być liczbą całkowitą

# invalidId
source: Incorrect data
pl: Niepoprawne dane

# releaseNotExists
source: The release doesn't exist in database.
pl: Podane wydanie nie istnieje w systemie.

# tagNotExists
source: The tag doesn't exist in database.
pl: Podany tag nie istnieje w systemie.

# fileExcludeExtensionFalse
source: Unsupported file extension.
pl: Plik ma złe rozszerzenie.

# fileExcludeExtensionNotFound
source: Cannot read the file or the file doesn't exist.
pl: Plik nie jest do odczytu lub nie istnieje.

# phoneNumberInvalidCharacters
source: Text can only consist of numbers, spaces and characters: +-()
pl: Tekst może zawierać wyłącznie cyfry, spacje oraz znaki +-()

# jiraInvalidProjectKey
source: Invalid JIRA project key.
pl: Nieprawidłowy klucz projektu JIRA.

source: Mantis project not exists.
pl: Projekt Mantis nie istnieje.

# mantisUrlIsIncorrect
source: The URL is incorrect or WSDL file is corrupted.
pl: Adres URL jest niepoprawny lub plik WSDL jest uszkodzony.

# mantisAccessDenied
source: The user does not have access to the project.
pl: Użytkownik nie ma dostępu do projektu.

# projectResolutionNameExists
source: Name of a status already exists in project.
pl: Nazwa statusu już istnieje w projekcie.

# projectResolutionColorExists
source: Color of a status already exists in project.
pl: Kolor statusu już istnieje w projekcie.

# taskTestExists
source: Test already exists in task.
pl: Test już istnieje w zadaniu.

# taskDefectExists
source: Issue already exists in task.
pl: Zgłoszenie już istnieje w zadaniu.

# defectTaskExists
source: Task already exists in issue.
pl: Zadanie już istnieje w zgłoszeniu.

# testDefectExists
source: Issue already exists in test.
pl: Zgłoszenie już istnieje w teście.

# tagInvalidIds
source: Invalid tag.
pl: Błędny tag.
