Repository: TestArenaTM/TestArena
Catalog: application/languages/*/role.po
Languages: pl

# TEMPLATE_CUSTOM
source: Custom
pl: Specjalny

# TEMPLATE_LEADER
source: Leader
pl: Lider

# TEMPLATE_GUEST
source: Guest
pl: Gość

# TEMPLATE_PROGRAMMER
source: Programmer
pl: Programista

# ACTION_PROJECT_ATTACHMENT
source: Manage attachments of project
pl: Zarządzanie załącznikami projektu

# ACTION_PROJECT_STATUS
source: Manage status of project
pl: Zarządzanie statusem projektu

# ACTION_REPORT_GENERATE
source: Generate report
pl: Generowanie raportu

# ACTION_RELEASE_MANAGEMENT
source: Manage releases
pl: Zarządzanie wydaniami

# ACTION_VERSION_MANAGEMENT
source: Manage versions
pl: Zarządzanie wersjami

# ACTION_ENVIRONMENT_MANAGEMENT
source: Manage environments
pl: Zarządzanie środowiskami

# ACTION_TAG_MANAGEMENT
source: Manage tags
pl: Zarządzanie tagami

# ACTION_TASK_ADD
source: Add tasks
pl: Dodawanie zadań

# ACTION_TASK_ASSIGN_ALL
source: Assign any task
pl: Przypisywanie dowolnych zadań

# ACTION_TASK_EDIT_ALL
source: Edit any task
pl: Edycja dowolnych zadań

# ACTION_TASK_DELETE_ALL
source: Delete any task
pl: Usuwanie dowolnych zadań

# ACTION_TASK_CHANGE_STATUS_ALL
source: Change status of any task
pl: Zmiana statusu dowolnych zadań

# ACTION_TASK_EDIT_CREATED_BY_YOU
source: Edit tasks created by yourself
pl: Edycja zadań stworzonych przez siebie

# ACTION_TASK_DELETE_CREATED_BY_YOU
source: Delete tasks created by yourself
pl: Usuwanie zadań stworzonych przez siebie

# ACTION_TASK_CHANGE_STATUS_CREATED_BY_YOU
source: Change status of tasks created by yourself
pl: Zmiana statusu zadań stworzonych przez siebie

# ACTION_TASK_CHANGE_STATUS_ASSIGNED_TO_YOU
source: Change status of tasks created by yourself
pl: Zmiana statusu zadań przypisanych do siebie

# ACTION_TASK_EDIT_ASSIGNED_TO_YOU
source: Edit tasks assigned to yourself
pl: Edycja zadań przypisanych do siebie

# ACTION_TASK_DELETE_ASSIGNED_TO_YOU
source: Delete tasks assigned to yourself
pl: Usuwanie zadań przypisanych do siebie

# ACTION_DEFECT_ADD
source: Add issues
pl: Dodawanie zgłoszeń

# ACTION_DEFECT_ASSIGN_ALL
source: Assign any issue
pl: Przypisywanie dowolnych zgłoszeń

# ACTION_DEFECT_EDIT_ALL
source: Edit any issue
pl: Edycja dowolnych zgłoszeń

# ACTION_DEFECT_DELETE_ALL
source: Delete any issue
pl: Usuwanie dowolnych zgłoszeń

# ACTION_DEFECT_CHANGE_STATUS_ALL
source: Change status of any issue
pl: Zmiana statusu dowolnych zgłoszeń

# ACTION_DEFECT_EDIT_CREATED_BY_YOU
source: Edit issues created by yourself
pl: Edycja zgłoszeń stworzonych przez siebie

# ACTION_DEFECT_DELETE_CREATED_BY_YOU
source: Delete issues created by yourself
pl: Usuwanie zgłoszeń stworzonych przez siebie

# ACTION_DEFECT_CHANGE_STATUS_CREATED_BY_YOU
source: Change status of issues created by yourself
pl: Zmiana statusu zgłoszeń stworzonych przez siebie

# ACTION_DEFECT_DELETE_ASSIGNED_TO_YOU
source: Delete issues assigned to yourself
pl: Usuwanie zgłoszeń przypisanych do siebie

# ACTION_DEFECT_CHANGE_STATUS_ASSIGNED_TO_YOU
source: Change status of issues assigned to yourself
pl: Zmiana statusu zgłoszeń przypisanych do siebie

# ACTION_DEFECT_EDIT_ASSIGNED_TO_YOU
source: Edit issues assigned to yourself
pl: Edycja zgłoszeń przypisanych do siebie

# ACTION_TEST_ADD
source: Add tests
pl: Dodawanie testów

# ACTION_TEST_EDIT_ALL
source: Edit any test
pl: Edycja dowolnych testów

# ACTION_TEST_EDIT_CREATED_BY_YOU
source: Edit tests created by yourself
pl: Edycja testów stworzonych przez siebie

# ACTION_TEST_DELETE_ALL
source: Delete any test
pl: Usuwanie dowolnych testów

# ACTION_TEST_DELETE_CREATED_BY_YOU
source: Delete tests created by yourself
pl: Usuwanie testów stworzonych przez siebie

# ACTION_TASK_TEST_MODIFY_ALL
source: Modify tests of any task
pl: Modyfikowanie testów w dowolnych zadaniach

# ACTION_TASK_TEST_MODIFY_ASSIGNED_TO_YOU
source: Modify tests of tasks assigned to yourself
pl: Modyfikowanie testów w zadaniach przypisanych do siebie

# ACTION_TASK_TEST_MODIFY_CREATED_BY_YOU
source: Modify tests of tasks created by yourself
pl: Modyfikowanie testów w zadaniach stworzonych przez siebie

# ACTION_TASK_DEFECT_MODIFY_ALL
source: Modify issues of any task
pl: Modyfikowanie zgłoszeń w dowolnych zadaniach

# ACTION_TASK_DEFECT_MODIFY_ASSIGNED_TO_YOU
source: Modify issues of tasks assigned to yourself
pl: Modyfikowanie zgłoszeń w zadaniach przypisanych do siebie

# ACTION_TASK_DEFECT_MODIFY_CREATED_BY_YOU
source: Modify issues of tasks created by yourself
pl: Modyfikowanie zgłoszeń w zadaniach stworzonych przez siebie

# ACTION_EXTENDING_PROJECT_STATISTIC
source: Extending project statistic
pl: Rozszerzenie statystyk dla projektu

# ACTION_HELPER_TASK_ASSIGN_ALL
source: Activation of the permission can lead to abuse caused by assigning tasks to each other and their modification or deletion based on other permissions.
pl: Aktywacja uprawnienia może prowadzić do nadużycia spowodowanego przypisywaniem do siebie zadań i ich modyfikacje lub usuwanie na podstawie innych uprawnień.

# ACTION_HELPER_DEFECT_ASSIGN_ALL
source: Activation of the permission can lead to abuse caused by assigning issues to each other and their modification or deletion based on other permissions.
pl: Aktywacja uprawnienia może prowadzić do nadużycia spowodowanego przypisywaniem do siebie zgłoszeń i ich modyfikacje lub usuwanie na podstawie innych uprawnień.
